ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/utilities/lfs/file_system_utils.c
/*! *****************************************************************************
 * @file:    file_system_utils.c
 * @brief:   file_system utility file.
 * @details: This contains the helper functions for the LFS
 * @version: $Revision: 1.0.1
 * @date:    $Date:16-June-2020
 -----------------------------------------------------------------------------
Copyright (c) 2020 Analog Devices, Inc.

All rights reserved.

Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:
  - Redistributions of source code must retain the above copyright notice,
    this list of conditions and the following disclaimer.
  - Redistributions in binary form must reproduce the above copyright notice,
    this list of conditions and the following disclaimer in the documentation
    and/or other materials provided with the distribution.
  - Modified versions of the software must be conspicuously marked as such.
  - This software is licensed solely and exclusively for use with processors
    manufactured by or for Analog Devices, Inc.
  - This software may not be combined or merged with other code in any manner
    that would cause the software to become subject to terms and conditions
    which differ from those listed here.
  - Neither the name of Analog Devices, Inc. nor the names of its
    contributors may be used to endorse or promote products derived
    from this software without specific prior written permission.
  - The use of this software may or may not infringe the patent rights of one
    or more patent holders.  This license does not release you from the
    requirement that you obtain separate licenses from these patent holders
    to use this software.

THIS SOFTWARE IS PROVIDED BY ANALOG DEVICES, INC. AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, NON-
INFRINGEMENT, TITLE, MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL ANALOG DEVICES, INC. OR CONTRIBUTORS BE LIABLE
FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, PUNITIVE OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, DAMAGES ARISING OUT OF
CLAIMS OF INTELLECTUAL PROPERTY RIGHTS INFRINGEMENT; PROCUREMENT OF
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifdef USE_FS

#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include "file_system_utils.h"
#include "hw_if_config.h"
#include "app_cfg.h"
#include "light_fs.h"
#include "nand_cmd.h"
#include "nand_functions.h"
#include "power_manager.h"

#include "nrf_log_ctrl.h"
#define NRF_LOG_MODULE_NAME FS_UTILS

#if FS_UTILS_CONFIG_LOG_ENABLED
#ifdef NRF_LOG_DEFAULT_LEVEL
#undef NRF_LOG_DEFAULT_LEVEL
#define NRF_LOG_DEFAULT_LEVEL FS_UTILS_CONFIG_LOG_LEVEL
#endif /* NRF_LOG_DEFAULT_LEVEL */
#define NRF_LOG_INFO_COLOR  FS_UTILS_CONFIG_INFO_COLOR
#define NRF_LOG_DEBUG_COLOR FS_UTILS_CONFIG_DEBUG_COLOR
#else /* FS_UTILS_CONFIG_LOG_ENABLED */
#define NRF_LOG_LEVEL       0
#endif /* FS_UTILS_CONFIG_LOG_ENABLED */
#ifdef PROFILE_TIME_ENABLED
#include "us_tick.h"
#endif /* PROFILE_TIME_ENABLED*/
#include "nrf_log.h"
/* logger module enable */
NRF_LOG_MODULE_REGISTER();

/* Exported types ----------------------------------------------------------*/
char gs_volume_name[] = "nand:0:";

static FS_FILE_STATE_ENUM_t ge_file_wr_access = FS_FILE_ACCESS_START;
static FS_FILE_STATE_ENUM_t ge_file_read_access = FS_FILE_ACCESS_START;

static _file_handler gh_fs_file_write_handler;
static _file_handler gh_fs_file_read_handler;
static struct _memory_buffer go_lfs_buffer;
_table_file_header gh_fs_table_file_header;
vol_info_buff_t vol_info_buff_var;

_memory_properties go_fs_mem_prop = {.mem_size = DATA_FLASH_SIZE,
                               .block_size = BLOCK_SIZE,
                               .page_size = PAGE_SIZE,
                               .pages_per_block = PAGES_PER_BLOCK,
                               .num_of_blocks = NUM_OF_BLOCKS};


/* config file memory */
uint32_t volatile gn_fs_used_config_memory = 0;

static uint8_t ga_file_list[64];
static uint8_t gn_file_count;

#ifdef UNUSED_CODES
static  const  char   *fs_hal_month_name[] = {
    "jan",    "feb",    "mar",    "apr",    "may",    "jun",
    "jul",    "aug",    "sep",    "oct",    "nov",    "dec"
};
#endif

/*!
  ****************************************************************************
  *@brief       Get Volume name of file system
  *@param       None
  *@return      character pointer to file name.
******************************************************************************/
const char *fs_hal_vol_name(void) {
  return gs_volume_name;
}

/*!
  ****************************************************************************
  *@brief       Get Size of volume name size of file system
  *@param       None
  *@return      Size of vol name.
******************************************************************************/
int fs_hal_vol_name_size(void) {
  return sizeof(gs_volume_name);
}

/*!
  ****************************************************************************
  *@brief       FS HAL initialization
  *@param       None
  *@return      FS_STATUS_ENUM_t:file system status.
******************************************************************************/
FS_STATUS_ENUM_t fs_hal_init(void) {
  bool fs_version = false;
  uint32_t fs_rem_space = 0;
  elfs_result version_error;

  /* Reset Nand Flash */
  if(nand_flash_init() == NAND_NRF_DRIVER_ERROR) {
      return FS_STATUS_INIT_DRIVER_ERR;
  }
  /* Unlock Memory */
  if(nand_func_set_block_lock(NAND_FUNC_BLOCK_LOCK_ALL_UNLOCKED) != NAND_FUNC_SUCCESS) {
    return FS_STATUS_ERR;
  }
  /* Initialize File system */
  if(lfs_openfs(&go_fs_mem_prop) != LFS_SUCCESS) {
    return FS_STATUS_ERR;
  }

