ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/utilities/lfs/file_system_utils.c
  version_error = lfs_check_comp_version(&fs_version);

  /* Check Version Compatibility */
  if(version_error == LFS_READ_RESERVED_INFO_ERROR);

    if(fs_version != true) {
      if(fs_hal_flash_reset() == FS_STATUS_ERR){
        return FS_STATUS_ERR;
       }
    }
    /* Read table page in structure to preserve contents */
    memset(&gh_fs_table_file_header,0,sizeof(gh_fs_table_file_header));

  if(read_table_file_in_toc(&gh_fs_table_file_header) == LFS_ERROR) {
    return FS_STATUS_ERR;
  }

  /* Get remaining space */
  if(LFS_SUCCESS != lfs_get_remaining_space(&fs_rem_space,LFS_DATA_FILE,&gh_fs_table_file_header)) {
    return FS_STATUS_ERR;
  }

  /* temporary variables back up */
  memset(&vol_info_buff_var,0,sizeof(vol_info_buff_var));
  vol_info_buff_var.tmp_head_pointer = gh_fs_table_file_header.head_pointer;
  vol_info_buff_var.tmp_tail_pointer = gh_fs_table_file_header.tail_pointer;
  vol_info_buff_var.avail_memory = fs_rem_space;
  vol_info_buff_var.used_memory = (go_fs_mem_prop.mem_size - fs_rem_space);
  uint32_t bad_block_num=0;
  if(vol_info_buff_var.tmp_head_pointer < vol_info_buff_var.tmp_tail_pointer) {
      /* Find no of Blocks which have gone bad in between */
      if(get_bad_block_number(&bad_block_num,vol_info_buff_var.tmp_head_pointer,vol_info_buff_var.tmp_tail_pointer,\
                              &gh_fs_table_file_header) != LFS_SUCCESS)  {
        return FS_STATUS_ERR;
      }
  }
  else if(vol_info_buff_var.tmp_head_pointer > vol_info_buff_var.tmp_tail_pointer )  {
      uint32_t tmp_bad_blk_num=0;
      /* Find no of blocks which have gone bad in between current head till total number of blocks */
      if(get_bad_block_number(&bad_block_num,vol_info_buff_var.tmp_head_pointer,go_fs_mem_prop.num_of_blocks,\
                              &gh_fs_table_file_header) != LFS_SUCCESS)  {
        return FS_STATUS_ERR;
      }

      tmp_bad_blk_num=0;
      /* get bad block number from File Block to Tail Pointer */
      if(get_bad_block_number(&tmp_bad_blk_num,FILEBLOCK,vol_info_buff_var.tmp_tail_pointer,\
        &gh_fs_table_file_header) != LFS_SUCCESS)  {
        return FS_STATUS_ERR;
      }

      bad_block_num += tmp_bad_blk_num;
  }

  else if(vol_info_buff_var.tmp_head_pointer == vol_info_buff_var.tmp_tail_pointer )  {
      /* Get no of Bad blocks betweeb FILEBLOCK and total blocks in flash */
     if(get_bad_block_number(&bad_block_num,FILEBLOCK,go_fs_mem_prop.num_of_blocks,\
        &gh_fs_table_file_header) != LFS_SUCCESS)  {
     return FS_STATUS_ERR;
    }
  }


    /* copy bad block num in structure */
    vol_info_buff_var.bad_block_num = bad_block_num;
    vol_info_buff_var.used_memory += (bad_block_num*go_fs_mem_prop.block_size);
    vol_info_buff_var.avail_memory -= (bad_block_num*go_fs_mem_prop.block_size);
  return FS_STATUS_OK;
}


/*!
  ****************************************************************************
  *@brief       Remount memory partition
  *@param       None
  *@return      FS_STATUS_ENUM_t:file system status
******************************************************************************/
FS_STATUS_ENUM_t fs_hal_mount(void) {
    return FS_STATUS_ERR;
}

/*!
  ****************************************************************************
  *@brief      Format the partition and initialize memory partition
  *@param      bool_t bfmt_config_blk: true - Remove both config and data files
  *                                    false - Remove only data files
  *@return     file system status.
******************************************************************************/
FS_STATUS_ENUM_t fs_hal_format(bool_t bfmt_config_blk) {
  uint32_t fs_rem_space=0;
  uint32_t bad_block_num=0;
  bool fs_version = false;

  /* Reset the memory */
  nand_flash_reset();

  /* reset strcucture */
  memset(&vol_info_buff_var,0,sizeof(vol_info_buff_var));
  if(lfs_format(bfmt_config_blk) != LFS_SUCCESS) {
    return   FS_STATUS_ERR;
  }

  /* Check Version Compatibility */
  if(lfs_check_comp_version(&fs_version) != LFS_SUCCESS) {
    return FS_STATUS_ERR;
  }

  if(fs_version != true) {
    return FS_STATUS_ERR;
  }

  /* update temp variables */
   /* Read table page in structure to preserve contents */
    memset(&gh_fs_table_file_header,0,sizeof(gh_fs_table_file_header));

  if(read_table_file_in_toc(&gh_fs_table_file_header) == LFS_ERROR) {
    return FS_STATUS_ERR;
  }

  /* Get remaining space */
  if(LFS_SUCCESS != lfs_get_remaining_space(&fs_rem_space,LFS_DATA_FILE,&gh_fs_table_file_header)) {
    return FS_STATUS_ERR;
  }

  /* temporary variables back up */
  vol_info_buff_var.tmp_head_pointer = gh_fs_table_file_header.head_pointer;
  vol_info_buff_var.tmp_tail_pointer = gh_fs_table_file_header.tail_pointer;
  vol_info_buff_var.used_memory = (go_fs_mem_prop.mem_size - fs_rem_space);
  vol_info_buff_var.avail_memory = fs_rem_space;

  /* check if after format list is updated */
  if(vol_info_buff_var.bad_block_updated != 0){
      if(get_bad_block_number(&bad_block_num,FILEBLOCK,go_fs_mem_prop.num_of_blocks,\
        &gh_fs_table_file_header) != LFS_SUCCESS)  {
      return FS_STATUS_ERR;
      }
      /* subtract mem bytes */
      vol_info_buff_var.avail_memory -= (bad_block_num*go_fs_mem_prop.block_size);
      vol_info_buff_var.used_memory += (bad_block_num*go_fs_mem_prop.block_size);
      vol_info_buff_var.bad_block_num = bad_block_num;
      vol_info_buff_var.bad_block_updated = 0;
 }
  return FS_STATUS_OK;
}

/*!
  ****************************************************************************
  *@brief      fs_block_erase
  *@param      block_no: block no to erase
  *@return     file system status.
******************************************************************************/
FS_STATUS_ENUM_t fs_block_erase(uint16_t block_no) {

  /* Reset the memory */
  nand_flash_reset();

  if((nand_func_erase(&go_fs_mem_prop,block_no,1)) != NAND_FUNC_SUCCESS) {
        NRF_LOG_INFO("Error in block erase");
       return FS_STATUS_ERR;
  }
  return FS_STATUS_OK;
}

/*!
  ****************************************************************************
  *@brief      fs_write_rsd_block
  *@param      data: data bytes to be written
               size: size of data bytes
  *@return     file system status.
******************************************************************************/
FS_STATUS_ENUM_t fs_write_rsd_block(uint32_t data[], uint16_t size) {

  /* Reset the memory */
  nand_flash_reset();

