ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/utilities/lfs/file_system_utils.c
   /* write file handler information */
  if(nand_func_write(&go_fs_mem_prop,(RESERVEDBLOCK*go_fs_mem_prop.block_size),\
                              size,(uint8_t *)&data) !=  NAND_FUNC_SUCCESS) {
    NRF_LOG_WARNING("Error in writing reserved block first page");
    return FS_STATUS_ERR;
  }

  return FS_STATUS_OK;
}

/*!
  ****************************************************************************
  *@brief      Write blocks of pattern data
  *@param     pbuff: buffer with pattern data
  *@param     start_block_num: block number to start writing data
  *@param     nbuff_size: size of buffer
  *@param     first_time_write: first time write flag
  *@return     FS_STATUS_ENUM_t:file system status.
*****************************************************************************/
FS_STATUS_ENUM_t fs_hal_write_blocks(uint8_t *pbuff, uint16_t start_block_num,\
                                    uint16_t nbuff_size, uint8_t first_time_write) {

  FS_STATUS_ENUM_t fs_err_status = FS_STATUS_ERR;
  if (fs_hal_write_access_state() == FS_FILE_ACCESS_IN_PROGRESS) {
    fs_err_status = fs_hal_fixed_pattern_write_file((uint8_t *)pbuff,
                                      start_block_num,
                                      &nbuff_size, &gh_fs_file_write_handler,first_time_write);
  }
  return fs_err_status;
}

/*!
  ****************************************************************************
  *@brief      Reset the head and tail pointers and flash
  *@param      None
  *@return     FS_STATUS_ENUM_t:file system status.
******************************************************************************/
FS_STATUS_ENUM_t fs_hal_flash_reset() {
  bool fs_version = false;
  uint8_t status=0;
  uint32_t fs_rem_space=0;
  uint32_t bad_block_num=0;

  /* Reset the memory */
  nand_flash_reset();
  /* read ecc */
  if(nand_func_check_ecc(&status) != NAND_FUNC_ERROR){
    if(!status) {
      nand_func_enable_ecc(true);
    }
  }
  if(lfs_flash_reset() != LFS_SUCCESS) {
    NRF_LOG_INFO("Error in lfs_flash_reset");
    return   FS_STATUS_ERR;
  }

  /* Check Version Compatibility */
  if(lfs_check_comp_version(&fs_version) != LFS_SUCCESS) {
    return FS_STATUS_ERR;
  }

  if(fs_version != true) {
    NRF_LOG_INFO("version written wrong after reset");
    return FS_STATUS_ERR;
  }

  /* update temp variables */
   /* Read table page in structure to preserve contents */
    memset(&gh_fs_table_file_header,0,sizeof(gh_fs_table_file_header));

  if(read_table_file_in_toc(&gh_fs_table_file_header) == LFS_ERROR) {
    return FS_STATUS_ERR;
  }

  /* Get remaining space */
  if(LFS_SUCCESS != lfs_get_remaining_space(&fs_rem_space,LFS_DATA_FILE,&gh_fs_table_file_header)) {
    return FS_STATUS_ERR;
  }

  /* temporary variables back up */
  memset(&vol_info_buff_var,0,sizeof(vol_info_buff_var));
  vol_info_buff_var.tmp_head_pointer = gh_fs_table_file_header.head_pointer;
  vol_info_buff_var.tmp_tail_pointer = gh_fs_table_file_header.tail_pointer;
  vol_info_buff_var.used_memory = (go_fs_mem_prop.mem_size - fs_rem_space);
  vol_info_buff_var.avail_memory = fs_rem_space;

  /* check if after format list is updated */
  if(get_bad_block_number(&bad_block_num,FILEBLOCK,go_fs_mem_prop.num_of_blocks,\
        &gh_fs_table_file_header) != LFS_SUCCESS)  {
      return FS_STATUS_ERR;
  }
  /* subtract mem bytes */
  vol_info_buff_var.avail_memory -= (bad_block_num*go_fs_mem_prop.block_size);
  vol_info_buff_var.used_memory += (bad_block_num*go_fs_mem_prop.block_size);
  vol_info_buff_var.bad_block_num = bad_block_num;

  return FS_STATUS_OK;
}


#ifdef UNUSED_CODES
/*!
  *@brief       Internal function determines displayed string format
  *@param       p_dirent   pointer to directory entry to be listed
  *@param       p_out_buffer   pointer to buffer to get file info string
  *@param       length   length of buffer
  *@return      file system status.
 */
FS_STATUS_ENUM_t _format_file_name_display(struct  fs_dirent   *p_dirent, char *p_out_buffer,\
                                          uint32_t length, uint8_t *file_type, uint32_t *file_size) {
  char                  out_str[41];
  CLK_DATE_TIME         stime;
  CPU_BOOLEAN           ok;
  fs_time_t           ts;

  /* Chk if file is dir.            */
  if (DEF_BIT_IS_SET(p_dirent->Info.Attrib, FS_ENTRY_ATTRIB_DIR) == DEF_YES) {
    out_str[0] = 'd';
  }
  /* Chk if file is rd only.        */
  if (DEF_BIT_IS_SET(p_dirent->Info.Attrib, FS_ENTRY_ATTRIB_WR) == DEF_YES) {
    out_str[2] = 'w';
    out_str[5] = 'w';
    out_str[8] = 'w';
  }
  /* Get file size.                 */
  if (p_dirent->Info.Size == 0) {
    if (DEF_BIT_IS_CLR(p_dirent->Info.Attrib, FS_ENTRY_ATTRIB_DIR) == DEF_YES) {
      *file_type = 1;
      *file_size = 0;
      Str_Copy(&out_str[11],"          0");
    }
  } else {
    Str_FmtNbr_Int32U(p_dirent->Info.Size,
                      10, 10, '0', DEF_NO, DEF_NO, &out_str[11]);
    *file_type = 1;
    *file_size = (uint32_t)p_dirent->Info.Size;
  }
  /* Get file date/time.            */
  if (p_dirent->Info.DateTimeWr != FS_TIME_TS_INVALID) {
    ok =  Clk_TS_UnixToDateTime  (p_dirent->Info.DateTimeWr,
                                  (CLK_TZ_SEC)  0,
                                  &stime);

    if (ok == DEF_YES) {
      (void)Str_Copy(&out_str[22], (CPU_CHAR *)fs_hal_month_name[stime.Month - 1u]);
      out_str[25] = (CPU_CHAR)ASCII_CHAR_SPACE;
      (void)Str_FmtNbr_Int32U((CPU_INT32U)stime.Day,        2u, 10u, ' ', DEF_NO, DEF_NO, &out_str[26]);
      (void)Str_FmtNbr_Int32U((CPU_INT32U)stime.Yr,         4u, 10u, ' ', DEF_NO, DEF_NO, &out_str[29]);
      (void)Str_FmtNbr_Int32U((CPU_INT32U)stime.Hr,         2u, 10u, ' ', DEF_NO, DEF_NO, &out_str[34]);
      out_str[36] = (CPU_CHAR)':';
      (void)Str_FmtNbr_Int32U((CPU_INT32U)stime.Min,        2u, 10u, ' ', DEF_NO, DEF_NO, &out_str[37]);
      out_str[39] = (CPU_CHAR)' ';
      out_str[40] = (CPU_CHAR)'\0';
    }
  } else {
    Mem_Set(&out_str[22], (CPU_INT08U)' ', 17u);
    out_str[40] = (CPU_CHAR)'\0';
  }
  if (Str_Len(out_str) > length) {
    return FS_STATUS_ERR;
  }
  /* Output info for entry.         */
  snprintf(p_out_buffer,length,"%s",p_dirent->Name);
  return FS_STATUS_OK;
}
#endif

