ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/utilities/lfs/file_system_utils.c
typedef enum {
  FS_DIR_ACCESS_START = 0x00,
  FS_DIR_ACCESS_IN_PROGRESS = 0x01,
} FS_DIR_STATUS_ENUM_t;

/*!
  ****************************************************************************
  *@brief       Searches for the given config file in file directory
  *@param       pfile_name: pointer to character array of config file
  *@param       nfile_nameLen: length of config file name
  *@param       bdelete_config_file: bool variable if set,
                given config file will be deleted from the LFS directory
  *@param       pconfig_file_found: pointer to the fileFound result flag
  *@return      FS_STATUS_ENUM_t:file system status.
******************************************************************************/
FS_STATUS_ENUM_t fs_hal_find_config_file( uint8_t *pfile_name, uint8_t nfile_nameLen,\
                                        bool_t bdelete_config_file, uint8_t *pconfig_file_found)
{
  uint8_t fileindex = 0;
  int  nFileCmpResult =-1;
  _file_handler tmp_file_handler;
  uint8_t status = 0;
  /* Reset the memory */
    nand_flash_reset();
  /* read ecc */
  if(nand_func_check_ecc(&status) != NAND_FUNC_ERROR){
    if(!status) {
      nand_func_enable_ecc(true);
    }
  }
  *pconfig_file_found = false;
    /* Get list of File indexes */
    if(lfs_get_file_indexes_list(ga_file_list, &gn_file_count) != LFS_SUCCESS) {
      return FS_STATUS_ERR;
    }

    while(fileindex < gn_file_count) {
      /* Open file by number */
      if(lfs_open_file_by_number(ga_file_list[fileindex], &tmp_file_handler) == LFS_SUCCESS) {
        /* Get file type */
        if(tmp_file_handler.head.file_type == LFS_CONFIG_FILE){
            nFileCmpResult = memcmp(pfile_name,tmp_file_handler.head.file_name,nfile_nameLen);
            if(!nFileCmpResult) {
             *pconfig_file_found = true;   /* Config File found */
             if(bdelete_config_file) {      /* Delete the config file */
              /* Get list of File indexes */
              if(lfs_delete_config_file(&tmp_file_handler) != LFS_SUCCESS) {
                 return FS_STATUS_ERR;
              }
            }
            break;
          }
        }
        else{
          *pconfig_file_found = false;   /* keep updating as Config file not found until its found */
        }
      } else {
        gn_file_count = 0;
        return FS_STATUS_ERR;
      }
      fileindex++;
    }
    /* if config file found and properly deleted, send start file status ok*/
    if(*pconfig_file_found == true){
      return FS_STATUS_OK;
    }
    else{
      /* send config file not found */
      return FS_STATUS_ERR_CONFIG_FILE_NOT_FOUND;
    }
}

/*!
  ****************************************************************************
  *@brief       Deletes the given config file in File directory
  *@param       pfile_name: pointer to character array of config file
  *@param       nfile_nameLen: length of config file name
  *@return      FS_STATUS_ENUM_t:file system status.
******************************************************************************/
FS_STATUS_ENUM_t fs_hal_delete_config_file( uint8_t *pfile_name, uint8_t nfile_nameLen) {
    uint8_t ncfg_file_flag = 0;
    FS_STATUS_ENUM_t fs_status;
    fs_status = fs_hal_find_config_file(pfile_name,nfile_nameLen,true, &ncfg_file_flag);
    return fs_status;
}

/*!
  ****************************************************************************
  *@brief       Opens last closed file handler and assigns head pointer
  *@param       None
  *@return      FS_STATUS_ENUM_t:file system status.
******************************************************************************/
FS_STATUS_ENUM_t fs_hal_append_file() {
  elfs_result ret = LFS_SUCCESS;

  /* Init structures */
  memset(&gh_fs_file_write_handler,0,sizeof(gh_fs_file_write_handler));
  memset(&gh_fs_table_file_header,0,sizeof(gh_fs_table_file_header));

  /* read table page */
  if(read_table_file_in_toc(&gh_fs_table_file_header) == LFS_ERROR) {
    return LFS_ERROR;
  }

  /* open file handler which is latest */
  ret = lfs_reopen_last_file_Info (&gh_fs_file_write_handler,\
                                   &gh_fs_table_file_header);
  if( ret != LFS_SUCCESS) {
    if(ret == LFS_NO_FILE_TO_APPEND_ERROR)  {
      NRF_LOG_INFO("Cannot append file as file is not found");
      return FS_STATUS_NO_FILE_TO_APPEND_ERROR;
    }
    else {
      NRF_LOG_INFO("Error in opening file handler");
       return FS_STATUS_ERR;
    }
  }

  /* re assign head pointer */
  if(lfs_append_opened_file (&gh_fs_file_write_handler,\
                            &gh_fs_table_file_header) != LFS_SUCCESS) {
    NRF_LOG_INFO("Error in initializing head pointer");
    return FS_STATUS_ERR;
  }
  
  NRF_LOG_INFO("Successfully opened and assigned; head pointer = %d",gh_fs_table_file_header.head_pointer);

  /* this field is very much needed to continue writing from last page which is head pointer */
  gh_fs_file_write_handler.curr_write_mem_loc = gh_fs_table_file_header.head_pointer * go_fs_mem_prop.page_size;

  return FS_STATUS_OK;
}

/*!
  ****************************************************************************
  *@brief       Opens last closed file handler and assigns head pointer
  *@param       None
  *@return      FS_STATUS_ENUM_t:file system status.
******************************************************************************/
FS_STATUS_ENUM_t set_write_handler_mode() {
     /* Set operating mode to Manual */
  lfs_set_operating_mode(&gh_fs_file_write_handler, LFS_MODE_MANUAL);
  
  /* Open file for writing */
  ge_file_wr_access = FS_FILE_ACCESS_IN_PROGRESS;
}

/*!
  ****************************************************************************
  *@brief       List files in directory
  *@param       p_dir_path: pointer to character array of directory path
  *@param       p_file_path: pointer to character array of file path
  *@param       length:ength
  *@param       file_type: pointer to file type
  *@param       file_size: pointer to file size
  *@return      FS_STATUS_ENUM_t: file system status.
*****************************************************************************/
FS_STATUS_ENUM_t fs_hal_list_dir(const char* p_dir_path, char *p_file_path, \
                                uint32_t length,uint8_t *file_type,uint32_t *file_size)
{
  static FS_DIR_STATUS_ENUM_t dir_access_status = FS_DIR_ACCESS_START;
  static uint8_t fileindex = 0;
  _file_handler tmp_file_handler;
  uint8_t status = 0;
  /* Reset the memory */
  nand_flash_reset();
  /* read ecc */
  if(nand_func_check_ecc(&status) != NAND_FUNC_ERROR) {
    if(!status) {
      nand_func_enable_ecc(true);
    }
  }
  if (dir_access_status == FS_DIR_ACCESS_START) {
    dir_access_status = FS_DIR_ACCESS_IN_PROGRESS;
    /* Get list of File indexes */
    if(lfs_get_file_indexes_list(ga_file_list, &gn_file_count) != LFS_SUCCESS) {
      dir_access_status = FS_DIR_ACCESS_START;
      return FS_STATUS_ERR;
    }
    if(gn_file_count > 0) {
      /* Open file by number */
      if(lfs_open_file_by_number(ga_file_list[fileindex], &tmp_file_handler) == LFS_SUCCESS) {
        /* Get file size */
        *file_size = tmp_file_handler.head.file_size;
        /* Get file name */
        for(int i = 0; i < 16; i++) {
          *p_file_path = tmp_file_handler.head.file_name[i];
          if(*p_file_path == '\0')
            break;
          p_file_path++;
        }
        /* Get file type */
        *file_type = tmp_file_handler.head.file_type;
      } else {
        gn_file_count = 0;
        dir_access_status = FS_DIR_ACCESS_START;
        return FS_STATUS_ERR;
      }
      fileindex++;
      return FS_STATUS_OK;
    } else {
      dir_access_status = FS_DIR_ACCESS_START;
      return FS_STATUS_ERR_EOD;
    }
  } else if (dir_access_status == FS_DIR_ACCESS_IN_PROGRESS) {
    if(fileindex < gn_file_count) {
      /* Open file by number */
      if(lfs_open_file_by_number(ga_file_list[fileindex], &tmp_file_handler) == LFS_SUCCESS) {
        /* Get file size */
        *file_size = tmp_file_handler.head.file_size;
        /* Get file name */
        for(int i = 0; i < 16; i++) {
          *p_file_path = tmp_file_handler.head.file_name[i];
          if(*p_file_path == '\0')
            break;
          p_file_path++;
        }
        /* Get file type */
        *file_type = tmp_file_handler.head.file_type;
      } else {
        fileindex = 0;
        gn_file_count = 0;
        dir_access_status = FS_DIR_ACCESS_START;
        return FS_STATUS_ERR;
      }
      fileindex++;
      return FS_STATUS_OK;
    } else if(fileindex == gn_file_count) {
      MCU_HAL_Delay(2);
      fileindex = 0;
      gn_file_count = 0;
      dir_access_status = FS_DIR_ACCESS_START;
      return FS_STATUS_ERR_EOD;
    }
  }
  return FS_STATUS_ERR;
}

/*!
  ****************************************************************************
  *@brief       Get the file information
  *@param[in]       pfile_index: pointer to file index
  *@param[out]      pfile_info: pointer to file information
  *@return      FS_STATUS_ENUM_t: file system status.
******************************************************************************/
FS_STATUS_ENUM_t fs_hal_get_file_info(uint8_t* pfile_index, file_info_t *pfile_info)
{
  _file_handler file_handler;
  if(LFS_SUCCESS != lfs_open_file_by_number(*pfile_index, &file_handler)) {
    return FS_STATUS_ERR;
  }

  for(uint8_t i=0; i < FILE_NAME_LEN; i++)
  {
    pfile_info->file_name[i] = file_handler.head.file_name[i];
    if(file_handler.head.file_name[i] == '\0') /* end of the file reached */
      break;
  }
  pfile_info->start_page = file_handler.head.mem_loc;
  pfile_info->end_page = file_handler.head.last_used_page;
  pfile_info->file_size = file_handler.head.file_size;

