ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/utilities/lfs/file_system_utils.c
  return FS_STATUS_OK;
}

/*!
  ****************************************************************************
  *@brief      It does sanity test of reading the given page from flash memory
  *@param[in]       ppage_num: page number to be tested
  *                 num_bytes: number of bytes to be read; maximum we can 100 bytes
  *@param[out]      ppage_read_test_info: pointer to page read test info
  *@return      FS_STATUS_ENUM_t: file system status.
******************************************************************************/
FS_STATUS_ENUM_t fs_hal_page_read_test(uint32_t* ppage_num, m2m2_file_sys_page_read_test_resp_pkt_t *ppage_read_test_info,uint8_t num_bytes)
{
  //calculate block no baased on page no, read it proper format, memcpy and send it out
  uint32_t block_ind = *ppage_num / go_fs_mem_prop.pages_per_block;
  memset(ppage_read_test_info->sample_data,0,num_bytes);

  if(block_ind == RESERVEDBLOCK){
    _fs_info tmp_file_info;

    /* Read within the reserved block */
    if(nand_func_read(&go_fs_mem_prop,(RESERVEDBLOCK*go_fs_mem_prop.block_size+*ppage_num),\
                    num_bytes,(uint8_t*)&tmp_file_info) != NAND_FUNC_SUCCESS)  {
      NRF_LOG_INFO("Error in reading version Information");
      ppage_read_test_info->data_region_status = -1;
    }
    else{
        ppage_read_test_info->data_region_status = 0;
    }

    NRF_LOG_INFO("foot print = %s, version = %d, revision = %d",
    nrf_log_push(tmp_file_info.foot_print),
    tmp_file_info.version,
    tmp_file_info.revision);

    memcpy(ppage_read_test_info->sample_data,(uint8_t *)&tmp_file_info,num_bytes);
  }

  else if(block_ind == TOCBLOCK){
    if((TOC_BLOCK_FIRST_PAGE <= *ppage_num) && (*ppage_num < (TOC_BLOCK_LAST_PAGE(TOC_BLOCK_FIRST_PAGE,TABLE_PAGE_INDEX_IN_TOC)) )){
      _file_header fileheader;
      /* file handler type */
       if(nand_func_read(&go_fs_mem_prop,(*ppage_num) * go_fs_mem_prop.page_size,\
                    num_bytes,(uint8_t*)&fileheader) != NAND_FUNC_SUCCESS)  {
              NRF_LOG_INFO("Error in reading file handler information");
              ppage_read_test_info->data_region_status = -1;
        }
        else{
        ppage_read_test_info->data_region_status = 0;
       }
       memcpy(ppage_read_test_info->sample_data,(uint8_t *)&fileheader,num_bytes);
    }
    else{
      _table_file_header tableheader;
      /* table file handler */
       if(nand_func_read(&go_fs_mem_prop,(*ppage_num) * go_fs_mem_prop.page_size,num_bytes,\
          (uint8_t*)&tableheader) != NAND_FUNC_SUCCESS){
          ppage_read_test_info->data_region_status = -1;
          NRF_LOG_INFO("Error in reading file handler information");
       }
       else{
        ppage_read_test_info->data_region_status = 0;
       }
          ppage_read_test_info->sample_data[0] = (uint8_t )tableheader.tail_pointer;
          ppage_read_test_info->sample_data[1] = (uint8_t )tableheader.head_pointer;
          ppage_read_test_info->sample_data[2] = (uint8_t )tableheader.initialized_circular_buffer;
          ppage_read_test_info->sample_data[3] = (uint8_t )tableheader.mem_full_flag;
          ppage_read_test_info->sample_data[4] = (uint8_t )tableheader.offset;
          ppage_read_test_info->sample_data[5] = (uint8_t )tableheader.config_low_touch_occupied;
      }
    }
  else{
#ifdef FS_TEST_BLOCK_READ_DEBUG
    ppage_read_test_info->data_region_status = read_page_data(*ppage_num, (uint8_t *)&ppage_read_test_info->sample_data, num_bytes);
#endif
  }

#ifdef FS_TEST_BLOCK_READ_DEBUG
  ppage_read_test_info->ecc_zone_status = read_page_ecc_zone(*ppage_num, &ppage_read_test_info->next_page,\
                                                            &ppage_read_test_info->occupied,&ppage_read_test_info->num_bytes_written);
#endif

  return (ppage_read_test_info->data_region_status | ppage_read_test_info->ecc_zone_status);
}


/*!
  ****************************************************************************
  *@brief       Get Size of file or directory
  *@param       p_path: pointer to character array of file path
  *@param       p_size: pointer to output file size
  *@return      FS_STATUS_ENUM_t: file system status.
******************************************************************************/
FS_STATUS_ENUM_t fs_hal_get_size(char* p_path, uint32_t *p_size)
{
  _file_handler file_handler;
  if(LFS_SUCCESS != lfs_open_file_by_name(p_path, &file_handler)) {
    return FS_STATUS_ERR;
  }
  /* Read File size info */
  *p_size = file_handler.head.file_size;
  return FS_STATUS_OK;
}

/*!
  ****************************************************************************
  *@brief       Get FS Volume info
  *@param       p_size   pointer to output FS volume info
  *@return      file system status.
*****************************************************************************/
FS_STATUS_ENUM_t fs_hal_get_vol_info(uint32_t *p_size) {

  /* usage of temp variables for vol info*/
  p_size[0] = DATA_FLASH_SIZE;
  p_size[1] = vol_info_buff_var.used_memory;
  p_size[2] = (((vol_info_buff_var.avail_memory/1024)*100)/(p_size[0]/1024));;
  NRF_LOG_INFO("Total memory=%d",p_size[0]);
  NRF_LOG_INFO("Used memory=%d",p_size[1]);
  NRF_LOG_INFO("Free memory=%d",p_size[2]);
  return FS_STATUS_OK;
}

/*!
  ****************************************************************************
  *@brief       read contents of file
  *@param       p_file_path: pointer to character array of file path
  *@param       p_buffer: pointer to buffer
  *@param       p_length: pointer to length
  *@param       p_page_number: current page number of file 
  *@return      FS_STATUS_ENUM_t: file system status.
*****************************************************************************/
#ifdef PROFILE_TIME_ENABLED
  uint32_t min_file_read_time,avg_file_read_time,max_file_read_time;
  uint32_t bytes_read_start_time,bytes_read_end_time;
  uint16_t num_times_read;
#endif
/* Start node to be scanned (also used as work area) */
uint32_t gbytesread;
uint8_t flag_failure;
FS_STATUS_ENUM_t fs_hal_read_file(char* p_file_path, uint8_t *p_buffer, uint32_t *p_length,uint32_t *p_page_number) {
  static uint32_t nfile_size = 0;
  static uint32_t read_size = 0;
  static uint32_t bytes_read = 0;
  if (ge_file_read_access == FS_FILE_ACCESS_START) {
    if (p_file_path == NULL) {
      return FS_STATUS_ERR;
    }
    /* Open file for reading */
    if(LFS_SUCCESS == lfs_open_file_by_name(p_file_path, &gh_fs_file_read_handler)) {
      /* Get File size */
      nfile_size = gh_fs_file_read_handler.head.file_size;
      /* Check for file length */
      if(*p_length < nfile_size) {
        read_size = *p_length;
      } else {
        read_size = nfile_size;
      }

//t1
#if PROFILE_TIME_ENABLED
    bytes_read_start_time = get_micro_sec();
#endif
      /* Read Data from file */
      if(lfs_read_file(p_buffer, bytes_read, &read_size, &gh_fs_file_read_handler, p_page_number) != LFS_SUCCESS) {
        ge_file_read_access = FS_FILE_ACCESS_START;
        bytes_read = 0;
        flag_failure=1;
        return FS_STATUS_ERR_STDIO;
      }
//t2
#if PROFILE_TIME_ENABLED
    bytes_read_end_time = get_micro_sec();
    avg_file_read_time += (bytes_read_end_time - bytes_read_start_time);
    if((bytes_read_end_time - bytes_read_start_time) < min_file_read_time )
    {
      min_file_read_time = (bytes_read_end_time - bytes_read_start_time);
    }
    if((bytes_read_end_time - bytes_read_start_time) > max_file_read_time)
    {
      max_file_read_time = (bytes_read_end_time - bytes_read_start_time);
    }
    num_times_read++;
#endif
      bytes_read += read_size;
      if (bytes_read == nfile_size) {
        *p_length = read_size;
        ge_file_read_access = FS_FILE_ACCESS_START;
        bytes_read = 0;
        return FS_STATUS_ERR_EOF;
      }
      *p_length = read_size;
      ge_file_read_access = FS_FILE_ACCESS_IN_PROGRESS;
      gbytesread = read_size;
      return FS_STATUS_OK;
    } else {      /* ... dir does not exist.        */
      ge_file_read_access = FS_FILE_ACCESS_START;
      bytes_read = 0;
      return FS_STATUS_ERR_INVALID_DIR;
    }
  } else if (ge_file_read_access == FS_FILE_ACCESS_IN_PROGRESS) {

