ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/utilities/lfs/file_system_utils.c
      /* Check for file length */
      if((*p_length + bytes_read) < nfile_size) {
        read_size = *p_length;
      } else {
        read_size = (nfile_size - bytes_read);
      }

      /* Read Data from file */
      if(lfs_read_file(p_buffer, bytes_read, &read_size, &gh_fs_file_read_handler, p_page_number) != LFS_SUCCESS) {
        ge_file_read_access = FS_FILE_ACCESS_START;
        bytes_read = 0;
        flag_failure=2;
        return FS_STATUS_ERR_STDIO;
      }

      bytes_read += read_size;
      gbytesread = read_size;

      if (bytes_read == nfile_size) {
        *p_length = read_size;
        ge_file_read_access = FS_FILE_ACCESS_START;
        bytes_read = 0;
        return FS_STATUS_ERR_EOF;
      }
      *p_length = read_size;
      ge_file_read_access = FS_FILE_ACCESS_IN_PROGRESS;
      return FS_STATUS_OK;
  }
  return FS_STATUS_ERR;
}

/*!
  ****************************************************************************
  *@brief       read contents of file with page offset
  *@param       p_file_path: pointer to character array of directory path
  *@param       p_buffer: pointer to character array to get the content of file
  *@param       p_length: number bytes to be read
  *@param       p_filesize: pointer to integer to get file size in bytes
  *@param       in_page_number: page_number to read interms of offset to the file start page number.
  *@param       p_out_page_number:current page_number from file read interms of offset to the file start page number.
  *@param       next_page_number: next page_number from file read interms of offset to the file start page number.
  *@return      FS_STATUS_ENUM_t:file system status.
*****************************************************************************/
FS_STATUS_ENUM_t fs_hal_read_pageoffset(char* p_file_path, uint8_t *p_buffer, \
                                        uint32_t *p_length,  uint32_t *p_filesize,\
                                        uint32_t in_page_number,uint32_t *p_out_page_number,uint32_t *next_page_number) {
  uint32_t nfilesize = 0;
  uint32_t read_size = 0;
  uint32_t bytes_read = 0;
  uint32_t offset = 0,maximum_page_offset = 0,nFileStartPagenumber = 0,nFileEndPagenumber = 0;
  
  if (ge_file_read_access == FS_FILE_ACCESS_START) {
    if (p_file_path == NULL) {
      return FS_STATUS_ERR;
    }
    
    /* Open file for reading */
    if(LFS_SUCCESS == lfs_open_file_by_name(p_file_path, &gh_fs_file_read_handler)) {
      /* Get File size */
      nfilesize = gh_fs_file_read_handler.head.file_size;
      nFileStartPagenumber = gh_fs_file_read_handler.current_read_pos/go_fs_mem_prop.page_size;
      nFileEndPagenumber = gh_fs_file_read_handler.head.last_used_page;

      maximum_page_offset = fs_get_file_page_number_offset(&nFileEndPagenumber,&nFileStartPagenumber,false);
      /* return error if user has given offset maximum than file size*/ 
      if (in_page_number  > maximum_page_offset){
        return FS_STATUS_ERR;
      }

      /*Get absolute page number*/
      if(nFileStartPagenumber + in_page_number <= MAX_DATA_FILE_BLOCK_PAGE_NUMBER){
        in_page_number = nFileStartPagenumber + in_page_number;
      }else{
        in_page_number = nFileStartPagenumber + in_page_number - FILE_PAGE_ROLL_OVER;
      }
      offset = in_page_number * go_fs_mem_prop.page_size;
      *p_filesize = nfilesize;
      /* Check for file length */
      if((*p_length + offset) < nfilesize) {
        read_size = *p_length;
      } else {
        read_size = (nfilesize - offset);
      }
      bytes_read += offset;
      gh_fs_file_read_handler.current_offset = offset;
      /* moving the file poniter read position with offset value */
      gh_fs_file_read_handler.current_read_pos = offset;
      /* Read Data from file */
      if(lfs_read_file(p_buffer, bytes_read, &read_size, &gh_fs_file_read_handler,p_out_page_number) != LFS_SUCCESS) {
        bytes_read = 0;
        return FS_STATUS_ERR_STDIO;
      }
      bytes_read += read_size;
      /*To confirm the page number is correct , reading it from that file and sending out*/
      *p_out_page_number = fs_get_file_page_number_offset(p_out_page_number,&nFileStartPagenumber,true);
      
      /*Get next page number also so that for chunk lost case we can read next page*/  
      *next_page_number = gh_fs_file_read_handler.current_read_pos/go_fs_mem_prop.page_size;
      *next_page_number = fs_get_file_page_number_offset(next_page_number,&nFileStartPagenumber,false);

      *p_length = read_size;
      return FS_STATUS_OK;
    } else {     /* ... dir does not exist.        */
      bytes_read = 0;
      return FS_STATUS_ERR_INVALID_DIR;
    }
  }
  return FS_STATUS_ERR;
}

/*!
  ****************************************************************************
  *@brief       open file
  *@param       p_filer_path:   pointer to character array of file path
  *@return      FS_STATUS_ENUM_t:file system status.
*****************************************************************************/
FS_STATUS_ENUM_t fs_hal_open_file(char* p_file_path)
{
  uint32_t fs_rem_space = 0;
  elfs_result lfs_status;
  uint8_t status = 0;
  bool mem_full = false;

   /* Reset the memory */
  nand_flash_reset();
  /* read ecc */
  if(nand_func_check_ecc(&status) != NAND_FUNC_ERROR){
    if(!status){
      nand_func_enable_ecc(true);
    }
  }

  /* Check for memory full */
  if(get_memory_status(&mem_full) != LFS_SUCCESS) {
    return FS_STATUS_ERR;
  }
  else  {
    /* check for memory full flag is set */
    if(mem_full == true){
      return FS_STATUS_ERR_MEMORY_FULL;
    }
  }

  /* File object */
  if (p_file_path == NULL) {
    return FS_STATUS_ERR;
  }

  NRF_LOG_INFO("********** Creating new file ****************");
  /* Create file */
  lfs_status = lfs_create_file((uint8_t *)p_file_path, &gh_fs_file_write_handler, \
                              &gh_fs_table_file_header,&go_lfs_buffer, LFS_DATA_FILE);
  if(lfs_status != LFS_SUCCESS) {
    if(lfs_status == LFS_MAX_FILE_COUNT_ERROR) {
      return FS_STATUS_ERR_MAX_FILE_COUNT;
    }
    else if(lfs_status == LFS_CONFIG_FILE_POSITION_ERROR) {
      return FS_STATUS_ERR_CONFIG_FILE_POSITION;
    } else {
      return FS_STATUS_ERR;
    }
  }
  /* Set operating mode to Manual */
  lfs_set_operating_mode(&gh_fs_file_write_handler, LFS_MODE_MANUAL);
  /* Open file for writing */
  ge_file_wr_access = FS_FILE_ACCESS_IN_PROGRESS;
  return FS_STATUS_OK;
}

/*!
  ****************************************************************************
  *@brief       open config file
  *@param       p_file_path: pointer to character array of file path
  *@return      FS_STATUS_ENUM_t:file system status.
*****************************************************************************/
FS_STATUS_ENUM_t fs_hal_open_config_file(uint8_t* p_file_path) {
  uint8_t status = 0;
  /* File object */
  if (p_file_path == NULL) {
    return FS_STATUS_ERR;
  }
  /* Reset the memory */
  nand_flash_reset();
  /* read ecc */
  if(nand_func_check_ecc(&status) != NAND_FUNC_ERROR){
    if(!status){
      nand_func_enable_ecc(true);
    }
  }
  /* Create file */
  if(LFS_SUCCESS != lfs_create_file(p_file_path, &gh_fs_file_write_handler,\
                                  &gh_fs_table_file_header,&go_lfs_buffer,\
                                   LFS_CONFIG_FILE)) {
    return FS_STATUS_ERR;
  }
  lfs_set_operating_mode(&gh_fs_file_write_handler, LFS_MODE_FAST);
  ge_file_wr_access = FS_FILE_ACCESS_IN_PROGRESS;
  return FS_STATUS_OK;
}

/*!
  ****************************************************************************
  *@brief       Close file
  *@param       file_handler: Handler to file
  *@return      FS_STATUS_ENUM_t: file system status.
*****************************************************************************/
FS_STATUS_ENUM_t fs_hal_close_file(_file_handler *file_handler) {
  uint32_t fs_rem_space = 0;
  elfs_result end_res;
  if(file_handler != NULL) {
  end_res = lfs_end_file(file_handler,&gh_fs_table_file_header);
    if (end_res == LFS_SUCCESS) {
      ge_file_wr_access = FS_FILE_ACCESS_START;
      memset(file_handler, 0, sizeof(_file_handler));
    } else {
      return FS_STATUS_ERR;
    }
  }
  /* Get remaining space */
  if(LFS_SUCCESS != lfs_get_remaining_space(&fs_rem_space,LFS_DATA_FILE,&gh_fs_table_file_header)) {
    return FS_STATUS_ERR;
  }

  /* update temp varaibles */
  /* temporary variables back up */
  vol_info_buff_var.tmp_head_pointer = gh_fs_table_file_header.head_pointer;
  vol_info_buff_var.tmp_tail_pointer = gh_fs_table_file_header.tail_pointer;
  vol_info_buff_var.avail_memory = fs_rem_space;
  vol_info_buff_var.used_memory = (go_fs_mem_prop.mem_size - fs_rem_space);

