ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/utilities/lfs/file_system_utils.c
   /* Subtract area corresponding to Bad blocks */
  vol_info_buff_var.used_memory += (vol_info_buff_var.bad_block_num*go_fs_mem_prop.block_size);
  vol_info_buff_var.avail_memory -= (vol_info_buff_var.bad_block_num*go_fs_mem_prop.block_size);

  return FS_STATUS_OK;
}

/*!
  ****************************************************************************
  *@brief       Get file count
  *@param       p_file_count: pointer in which the number of files
                present is returned
  *@return      FS_STATUS_ENUM_t: file system status.
*****************************************************************************/
FS_STATUS_ENUM_t fs_hal_get_file_count(uint8_t *p_file_count) {
    /* Reset the memory */
    nand_flash_reset();

    // data offset variable
    if(lfs_get_file_count(&gn_file_count) != LFS_ERROR){
      *p_file_count = gn_file_count;
    }
    else{
      *p_file_count=0;
      return FS_STATUS_ERR;
    }

  return FS_STATUS_OK;
}

/*!
  ****************************************************************************
  *@brief       write contents of buffer to config file
  *@param       p_buffer: pointer to buffer
  *@param       n_items: Number of items to write to file
  *@param       file_handler: handlr to file
  *@return      file system status.
******************************************************************************/
FS_STATUS_ENUM_t fs_hal_write_config_file(uint8_t *p_buffer,
                                          uint32_t *nitems,
                                          _file_handler *file_handler) {
  elfs_result      FS_Error;
  static uint32_t nBytes_written = 0;
  if (ge_file_wr_access != FS_FILE_ACCESS_IN_PROGRESS){
    return FS_STATUS_ERR;
  }
  /* Write data to File */
  FS_Error = lfs_update_config_file(p_buffer, *nitems, file_handler);
  /* Update Used memory */
  gn_fs_used_config_memory += *nitems;
  /* Updated bytes written to Flash */
  nBytes_written += *nitems;
  // TO DO
  if(nBytes_written >= 16384) { /* greater than 4 pages */
    nBytes_written = 0;
    /* Refresh Handler */
    if(file_handler->op_mode == LFS_MODE_MANUAL) {
      lfs_refresh_config_header(file_handler);
    }
  }
  // TO DO
  /* Check for memory full */
  /* block of data =  2044 * 64 * 4096 */
  if(gn_fs_used_config_memory >= BLOCK_SIZE) {
    return FS_STATUS_ERR_MEMORY_FULL;
  }
  if (FS_Error != LFS_SUCCESS) {
    if (lfs_end_config_file(file_handler) == LFS_SUCCESS) {
      ge_file_wr_access = FS_FILE_ACCESS_START;
        return FS_STATUS_ERR_EOF;
    } else {
        return FS_STATUS_ERR;
    }
  }
  return FS_STATUS_OK;
}

/*!
  ****************************************************************************
  *@brief       write contents of buffer to file
  *@param       p_buffer: pointer to buffer of data
  *@param       n_items: number of data items
  *@param       file_handler: handler to file
  *@return      FS_STATUS_ENUM_t: file system status.
*****************************************************************************/
FS_STATUS_ENUM_t fs_hal_write_file(uint8_t *p_buffer,
                                   uint32_t *nitems,
                                   _file_handler *file_handler) {
  elfs_result FS_Error;
  static uint32_t nBytes_written = 0;
  uint32_t fs_rem_space = 0;
  uint32_t bad_block_num = 0;

  if (ge_file_wr_access != FS_FILE_ACCESS_IN_PROGRESS) {
    return FS_STATUS_ERR;
  }
#ifdef PROFILE_TIME_ENABLED
uint32_t nTick = 0;
nTick = MCU_HAL_GetTick();
#endif
  

  /* Write data to File */
   FS_Error = lfs_update_file(p_buffer, *nitems, file_handler,&gh_fs_table_file_header);

#ifdef PROFILE_TIME_ENABLED
     uint32_t pkt_update_time = MCU_HAL_GetTick() - nTick;
   //  NRF_LOG_INFO("Time taken for lfs update file = %d",pkt_update_time);
#endif

  /* Updated bytes written to Flash */
  nBytes_written += *nitems;

  if(nBytes_written >= BLOCK_SIZE) { /* updating header for block */
    nBytes_written = 0;
    /* Refresh Handler */
    if(file_handler->op_mode == LFS_MODE_MANUAL) {
      lfs_refresh_header(file_handler,&gh_fs_table_file_header);
    }

     /* estimate for every block */
    if(LFS_SUCCESS != lfs_get_remaining_space(&fs_rem_space,LFS_DATA_FILE,&gh_fs_table_file_header)) {
      return FS_STATUS_ERR;
    }

   /* update temp variables while writing */
   vol_info_buff_var.tmp_head_pointer = gh_fs_table_file_header.head_pointer;
   vol_info_buff_var.tmp_tail_pointer = gh_fs_table_file_header.tail_pointer;
   vol_info_buff_var.avail_memory = fs_rem_space;
   vol_info_buff_var.used_memory = (go_fs_mem_prop.mem_size - fs_rem_space);

   if(vol_info_buff_var.bad_block_updated != 0){
        /* subtract mem bytes 1 block of data*/
        vol_info_buff_var.used_memory += go_fs_mem_prop.block_size;
        vol_info_buff_var.avail_memory -= go_fs_mem_prop.block_size;
        vol_info_buff_var.bad_block_num += 1;
        vol_info_buff_var.bad_block_updated=0;
     }
  }
  
  /* process memory full error, here file is already closed with  file updation  */
  if(FS_Error == LFS_MEMORY_FULL_ERROR){
    
    /* estimate for every block */
    if(LFS_SUCCESS != lfs_get_remaining_space(&fs_rem_space,LFS_DATA_FILE,&gh_fs_table_file_header)) {
      return FS_STATUS_ERR;
    }

    /* update temp variables while writing */
    vol_info_buff_var.tmp_head_pointer = gh_fs_table_file_header.head_pointer;
    vol_info_buff_var.tmp_tail_pointer = gh_fs_table_file_header.tail_pointer;
    vol_info_buff_var.avail_memory = fs_rem_space;
    vol_info_buff_var.used_memory = (go_fs_mem_prop.mem_size - fs_rem_space);

    if(vol_info_buff_var.bad_block_updated != 0){
      /* subtract mem bytes 1 block of data*/
      vol_info_buff_var.used_memory += go_fs_mem_prop.block_size;
      vol_info_buff_var.avail_memory -= go_fs_mem_prop.block_size;
      vol_info_buff_var.bad_block_num += 1;
      vol_info_buff_var.bad_block_updated=0;
    }
    return FS_STATUS_ERR_MEMORY_FULL;
  }
 
  /* close file if error, except memory full as file is already closed inside */
  if (FS_Error != LFS_SUCCESS) {
    /* file closed as cannot be recovered */
    if(FS_Error == LFS_FILE_WRITE_ERROR)
      /* update in file header as invalid */
      file_handler->head.file_type = LFS_INVALID_FILE;
    if (lfs_end_file(file_handler,&gh_fs_table_file_header) == LFS_SUCCESS) {
      ge_file_wr_access = FS_FILE_ACCESS_START;
      if(FS_Error == LFS_FILE_WRITE_ERROR)
        return FS_STATUS_ERR_INVALID_FILE;
      else
        return FS_STATUS_ERR_EOF;
    } else {
       if(FS_Error == LFS_FILE_WRITE_ERROR)
        return FS_STATUS_ERR_INVALID_FILE;
      else
        return FS_STATUS_ERR;
    }
  }

