ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/utilities/lfs/file_system_utils.c
  return FS_STATUS_OK;
}

/*!
  ****************************************************************************
  *@brief       write contents of pattern data buffer to file
  *@param       p_buffer: pointer to pattern buffer
  *@param       start_block_num: start block where data to be written
  *@param       nitems: number fo items to write
  *@param       file_handler: handlrer to file
  *@param       first_time_write: first time write flag
  *@return      FS_STATUS_ENUM_t: file system status.
*****************************************************************************/
FS_STATUS_ENUM_t fs_hal_fixed_pattern_write_file(uint8_t *p_buffer,uint16_t start_block_num,\
                                                uint16_t *nitems, _file_handler *file_handler,\
                                                uint8_t first_time_write) {
  elfs_result      FS_Error;
  static uint32_t nBytes_written = 0;
  uint32_t fs_rem_space = 0;

  if (ge_file_wr_access != FS_FILE_ACCESS_IN_PROGRESS){
    return FS_STATUS_ERR;
  }

 
  /* Write data to File */
  FS_Error = lfs_update_pattern_file(p_buffer, start_block_num,*nitems,file_handler,\
                                    &gh_fs_table_file_header,first_time_write);

  /* Updated bytes written to Flash */
  nBytes_written += *nitems;

  /* update toc & fs vol info variables for block size */
  if(nBytes_written >= TOC_REPEATED_UPDATE_SIZE) { 
    nBytes_written = 0;
    /* Refresh Handler */
    if(file_handler->op_mode == LFS_MODE_MANUAL) {
      lfs_refresh_header(file_handler,&gh_fs_table_file_header);
    }

     /* estimate for every block */
    if(LFS_SUCCESS != lfs_get_remaining_space(&fs_rem_space,LFS_DATA_FILE,&gh_fs_table_file_header)) {
      return FS_STATUS_ERR;
    }

   /* update temp variables while writing */
   vol_info_buff_var.tmp_head_pointer = gh_fs_table_file_header.head_pointer;
   vol_info_buff_var.tmp_tail_pointer = gh_fs_table_file_header.tail_pointer;
   vol_info_buff_var.avail_memory = fs_rem_space;
   vol_info_buff_var.used_memory = (go_fs_mem_prop.mem_size - fs_rem_space);

   if(vol_info_buff_var.bad_block_updated != 0){
        /* subtract mem bytes 1 block of data*/
        vol_info_buff_var.used_memory += go_fs_mem_prop.block_size;
        vol_info_buff_var.avail_memory -= go_fs_mem_prop.block_size;
        vol_info_buff_var.bad_block_num += 1;
        vol_info_buff_var.bad_block_updated=0;
     }
  }
  
   /* process memory full error, here file is already closed with  file updation  */
  if(FS_Error == LFS_MEMORY_FULL_ERROR){
    /* update temporary variables */
    /* estimate for every block */
    if(LFS_SUCCESS != lfs_get_remaining_space(&fs_rem_space,LFS_DATA_FILE,&gh_fs_table_file_header)) {
      return FS_STATUS_ERR;
    }

   /* update temp variables while writing */
   vol_info_buff_var.tmp_head_pointer = gh_fs_table_file_header.head_pointer;
   vol_info_buff_var.tmp_tail_pointer = gh_fs_table_file_header.tail_pointer;
   vol_info_buff_var.avail_memory = fs_rem_space;
   vol_info_buff_var.used_memory = (go_fs_mem_prop.mem_size - fs_rem_space);

   if(vol_info_buff_var.bad_block_updated != 0){
        /* subtract mem bytes 1 block of data*/
        vol_info_buff_var.used_memory += go_fs_mem_prop.block_size;
        vol_info_buff_var.avail_memory -= go_fs_mem_prop.block_size;
        vol_info_buff_var.bad_block_num += 1;
        vol_info_buff_var.bad_block_updated=0;
     }
    return FS_STATUS_ERR_MEMORY_FULL;
  }
  
  /* close file if error, except memory full as file is already closed inside */
  if (FS_Error != LFS_SUCCESS) {
    /* file closed as cannot be recovered */
    if(FS_Error == LFS_FILE_WRITE_ERROR)
    /* update in file header as invalid */
      file_handler->head.file_type = LFS_INVALID_FILE;
    if (lfs_end_file(file_handler,&gh_fs_table_file_header) == LFS_SUCCESS) {
      ge_file_wr_access = FS_FILE_ACCESS_START;
      if(FS_Error == LFS_FILE_WRITE_ERROR)
        return FS_STATUS_ERR_INVALID_FILE;
      else
        return FS_STATUS_ERR_EOF;
    } else {
       if(FS_Error == LFS_FILE_WRITE_ERROR)
        return FS_STATUS_ERR_INVALID_FILE;
      else
        return FS_STATUS_ERR;
    }
  }
  return FS_STATUS_OK;
}

/*!
  ****************************************************************************
  *@brief       get file write access state
  *@param       None
  *@return      FS_STATUS_ENUM_t: file system status.
*****************************************************************************/
FS_FILE_STATE_ENUM_t fs_hal_write_access_state(void) {
  return ge_file_wr_access;
}

/*!
  ****************************************************************************
  *@brief       get file write pointer
  *@param       None
  *@return      _file_handler: file handler
*****************************************************************************/
_file_handler *fs_hal_write_file_pointer(void) {
  return &gh_fs_file_write_handler;
}

/*!
  ****************************************************************************
  *@brief       get file read pointer
  *@param       None
  *@return      _file_handler: file handler
*****************************************************************************/
_file_handler *fs_hal_get_read_file_pointer(void) {
  return &gh_fs_file_read_handler;
}

/*!
  ****************************************************************************
  *@brief       write m2m packet structure to file
  *@param       pkt: m2m2_hdr_t packet structure
  *@return      M2M2_APP_COMMON_STATUS_ENUM_t: Status of file write
*****************************************************************************/
M2M2_APP_COMMON_STATUS_ENUM_t fs_hal_write_packet_stream(m2m2_hdr_t *pkt)
{
  uint32_t buffersize;
  FS_STATUS_ENUM_t fs_err_status;
  if (fs_hal_write_access_state() == FS_FILE_ACCESS_IN_PROGRESS) {
    buffersize = pkt->length;
    /* swap from network byte order to little endian */
    pkt->src = (M2M2_ADDR_ENUM_t)BYTE_SWAP_16(pkt->src);
    pkt->dest = (M2M2_ADDR_ENUM_t)BYTE_SWAP_16(pkt->dest);
    pkt->length = BYTE_SWAP_16(pkt->length);
    pkt->checksum = BYTE_SWAP_16(pkt->checksum);
#ifdef PROFILE_TIME_ENABLED
uint32_t nTick = 0;
nTick = MCU_HAL_GetTick();
#endif
    fs_err_status = fs_hal_write_file((uint8_t *)pkt,
                                      &buffersize, &gh_fs_file_write_handler);

#ifdef PROFILE_TIME_ENABLED
          uint32_t hal_pkt_write_time = MCU_HAL_GetTick() - nTick;
         // NRF_LOG_INFO("Time taken for packet write time = %d",hal_pkt_write_time);
#endif
    /* swap back from network byte order to little endian */
    /* TODO: Check if length swap back is sufficient */
    pkt->src = (M2M2_ADDR_ENUM_t)BYTE_SWAP_16(pkt->src);
    pkt->dest = (M2M2_ADDR_ENUM_t)BYTE_SWAP_16(pkt->dest);
    pkt->length = BYTE_SWAP_16(pkt->length);
    pkt->checksum = BYTE_SWAP_16(pkt->checksum);
    if (fs_err_status != FS_STATUS_OK) {
      if (fs_err_status == FS_STATUS_ERR_EOF){
        return M2M2_APP_COMMON_STATUS_STREAM_STOPPED;
      } 
      else if (fs_err_status == FS_STATUS_ERR_MEMORY_FULL){
        /* reset flag write access */
        ge_file_wr_access = FS_FILE_ACCESS_START;
        return (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_ERR_MEMORY_FULL;
      }
      else if(fs_err_status == FS_STATUS_ERR_INVALID_FILE) {
        return (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_ERR_INVALID;
      }
      else{
        return  M2M2_APP_COMMON_STATUS_ERROR;
      }
    } 
    else {
      return  M2M2_APP_COMMON_STATUS_OK;
    }
  } 
  else {
    return M2M2_APP_COMMON_STATUS_STREAM_NOT_STARTED;
  }
}

/*!
  ****************************************************************************
  *@brief       write test pattern to file
  *@param       pbuff: pointer to the test pattern array
  *@param       nbuff_size: size of the test pattern array
  *@return      M2M2_APP_COMMON_STATUS_ENUM_t: file system status.
*****************************************************************************/
M2M2_APP_COMMON_STATUS_ENUM_t fs_hal_test_pattern_write(uint8_t* pbuff,
                                                        uint32_t nbuff_size) {
  FS_STATUS_ENUM_t fs_err_status;
	if (fs_hal_write_access_state() == FS_FILE_ACCESS_IN_PROGRESS) {
          fs_err_status = fs_hal_write_file((uint8_t *)pbuff,
                                      &nbuff_size, &gh_fs_file_write_handler);
          if (fs_err_status != FS_STATUS_OK) {
            if (fs_err_status == FS_STATUS_ERR_EOF) {
		return M2M2_APP_COMMON_STATUS_STREAM_STOPPED;
            } 
            else if (fs_err_status == FS_STATUS_ERR_MEMORY_FULL)  {
              /* reset flag write access */
              ge_file_wr_access = FS_FILE_ACCESS_START;
              return (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_ERR_MEMORY_FULL;
            }
            else  {
              return  M2M2_APP_COMMON_STATUS_ERROR;
            }
          } else {
            return  M2M2_APP_COMMON_STATUS_OK;
          }
	}
  return  M2M2_APP_COMMON_STATUS_ERROR;
}

/*!
  ****************************************************************************
  *@brief       write test pattern to config file
  *@param       pbuff: pointer to the test pattern array
  *@param       nbuff_size: size of the test pattern array
  *@return      M2M2_APP_COMMON_STATUS_ENUM_t: file system status.
******************************************************************************/
M2M2_APP_COMMON_STATUS_ENUM_t fs_hal_test_pattern_config_write(uint8_t* pbuff,
                                                               uint32_t nbuff_size) {
  FS_STATUS_ENUM_t fs_err_status;
  if (fs_hal_write_access_state() == FS_FILE_ACCESS_IN_PROGRESS) {

    fs_err_status = fs_hal_write_config_file((uint8_t *)pbuff,
                                      &nbuff_size, &gh_fs_file_write_handler);
    if (fs_err_status != FS_STATUS_OK) {
      if (fs_err_status == FS_STATUS_ERR_EOF) {
        return M2M2_APP_COMMON_STATUS_STREAM_STOPPED;
      } else if (fs_err_status == FS_STATUS_ERR_MEMORY_FULL) {
        return (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_ERR_MEMORY_FULL;
      } else {
        return  M2M2_APP_COMMON_STATUS_ERROR;
      }
    } else {
      return  M2M2_APP_COMMON_STATUS_OK;
    }
  } else {
    return M2M2_APP_COMMON_STATUS_STREAM_NOT_STARTED;
  }
}

/*!
  ****************************************************************************
  *@brief       make response packet for fs write error
  *@param       src: m2m2_hdr_t packet structure, source address
  *@return      None
*****************************************************************************/
void fs_hal_write_error_resp(m2m2_hdr_t *response_pkt,M2M2_ADDR_ENUM_t *src) {
  _m2m2_app_common_cmd_t *stream_resp = (_m2m2_app_common_cmd_t *)&response_pkt->data[0];
  stream_resp->command = M2M2_APP_COMMON_CMD_STREAM_START_RESP;
  stream_resp->status = M2M2_APP_COMMON_STATUS_ERROR;
  response_pkt->src = M2M2_ADDR_SYS_FS;
  response_pkt->dest = *src;
  *src = M2M2_ADDR_UNDEFINED;
}

/*!
  ****************************************************************************
  *@brief       Unblock flash
  *@param       None
  *@return      FS_STATUS_ENUM_t: file system status
*****************************************************************************/
FS_STATUS_ENUM_t fs_hal_unblock_flash(void) {
  if(nand_func_set_block_lock(NAND_FUNC_BLOCK_LOCK_ALL_UNLOCKED) != NAND_FUNC_SUCCESS) {
    return FS_STATUS_ERR;
  }
  return FS_STATUS_OK;
}

/*!
  ****************************************************************************
  *@brief       Check for availability of file
  *@param       file_name: name of file
  *@return      FS_STATUS_ENUM_t: file system status.
*****************************************************************************/
FS_STATUS_ENUM_t fs_hal_find_file(char* file_name) {
  _file_handler tmp_file_handler;
  /* Get list of File indexes */
  if(lfs_get_file_indexes_list(ga_file_list, &gn_file_count) != LFS_SUCCESS){
    return FS_STATUS_ERR;
  }
  /* compare for file name */
  if(gn_file_count > 0){
    for(int i = 0; i < gn_file_count; i++) {
      /* Open file by number */
      if(lfs_open_file_by_number(ga_file_list[i], &tmp_file_handler) == LFS_SUCCESS){
        /* Compare file names */
        if(strcmp(file_name, (char *)&tmp_file_handler.head.file_name[0]) == 0) {
          return FS_STATUS_OK;
        }
      }
    }
  }
  return FS_STATUS_ERR;
}

/*!
  ****************************************************************************
  *@brief       Power on flash
  *@param       benable: flag to power on/off flash
  *@return      FS_STATUS_ENUM_t: file system status.
*****************************************************************************/
FS_STATUS_ENUM_t fs_flash_power_on (bool benable) {
  if(benable && (adp5360_is_ldo_enable(FS_LDO) == false)) {
    /* Switch On LDO3 */
    adp5360_enable_ldo(FS_LDO, true);
    /* Reset the memory */
    nand_flash_reset();
    /* Unblock locked flash module */
    if(fs_hal_unblock_flash() != FS_STATUS_OK) {
      return FS_STATUS_ERR;
    }
  }
  else if ((!benable) &&  (adp5360_is_ldo_enable(FS_LDO) == true)) {
    /* Check for file write and read in progress */
    if((fs_hal_write_access_state() == FS_FILE_ACCESS_START) && \
                     (ge_file_read_access == FS_FILE_ACCESS_START)) {
        adp5360_enable_ldo(FS_LDO, false);
    }
  }
  return FS_STATUS_OK;
}

/*!
  ****************************************************************************
  *@brief       Page number offset from start page number of a file
  *@param       CurrentPageNumber:current page number of file
  *@param       StartPageNumber: start page number of file
  *@param       bHandleRollover: True  - Handle 16 bit roll over for page number offset
                                 False - Disable Roll over for page number offset  
  *@return      uint32_t: Page number offset.
*****************************************************************************/
uint32_t fs_get_file_page_number_offset(uint32_t *CurrentPageNumber, uint32_t *StartPageNumber, bool bHandleRollover) {
uint32_t PageNumberOffset = 0;
uint32_t nRollover = 65536;
  if(!bHandleRollover)
    nRollover = 0;

  if(*CurrentPageNumber  >= *StartPageNumber){
    PageNumberOffset = (*CurrentPageNumber - *StartPageNumber) % nRollover;
  }else{
    PageNumberOffset  = ((*CurrentPageNumber + FILE_PAGE_ROLL_OVER)  - *StartPageNumber) % nRollover;
  }
  return PageNumberOffset;
}

#ifdef TEST_FS_NAND
#define MAX_BLOCKSIZE           2048
void fs_hal_test_file_write_read(uint32_t inp_num_iter, uint32_t block_size)
{
  FS_FILE *test_file;     /* File object */
  uint32_t byteswritten, bytesread;                     /* File write/read counts */
  uint32_t num_iter, i, time_ms, max_time;
  uint32_t cpu_cycle_scale = (MCU_HAL_GetCoreClock() / 1000000);
  uint64_t total_time;
  uint8_t tstbuf[MAX_BLOCKSIZE];

  FS_TRACE_INFO(("\r\nPerforming FS test. Number of iterations = %d. Block Size = %d bytes.\r\n", inp_num_iter, block_size));
  do {
    if(block_size > MAX_BLOCKSIZE)
    {
      FS_TRACE_INFO((":FAIL. Entered block size is greater than MAX_BLOCKSIZE.\r\n"));
      break;
    }
    for(i = 0; i < sizeof(tstbuf); i++)
      tstbuf[i] = 'A' + i%26;
    FS_TRACE_INFO(("\r\nWriting to file.\r\n"));
    if((test_file = fs_fopen("nand:0:\\TEST.LOG", "ab+")) == NULL)
    {
      FS_TRACE_INFO((":FAIL. fs_fopen failed.\r\n"));
      break;
    }
    if (fs_setvbuf(test_file, (void *)fileAccessBuf, FS__IOFBF, sizeof(fileAccessBuf)) != 0) {
      Debug_Handler();
    }

