ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/utilities/lfs/file_system_utils.c
    num_iter = inp_num_iter;
    total_time = 0;
    max_time = 0;
    FS_TRACE_INFO((":BENCHMARK, %s,%s\r\n", "fs_fwrite iteration", "Time in milli seconds" ));
    for (; num_iter > 0; num_iter--)
    {
      time_ms = MCU_HAL_GetTick();
      byteswritten = fs_fwrite(tstbuf, sizeof(uint8_t), block_size, test_file);
      time_ms = MCU_HAL_GetTick() - time_ms;
      total_time += time_ms;
      if (time_ms > max_time)
        max_time = time_ms;

      FS_TRACE_INFO((":BENCHMARK, %d,%d\r\n", num_iter, time_ms));

      if((byteswritten != block_size))
      {
        FS_TRACE_INFO((":FAIL. fs_fwrite failed.\r\n"));
        break;
      }
    }
    FS_TRACE_INFO(("Average fs_fwrite time = %dms. Max fs_fwrite time = %dms. \r\n", (int)(total_time/inp_num_iter), max_time));
    FS_TRACE_INFO((":BENCHMARK, Average fs_fwrite time = %dms. Max fs_fwrite time = %dms. \r\n", (int)(total_time/inp_num_iter), max_time));
    if(num_iter == 0)
    {
      FS_TRACE_INFO((":PASS. File write PASS.\r\n"));
    }
    else
    {
      FS_TRACE_INFO(("Remaining count = %d\r\n",num_iter));
      break;
    }

    fs_fflush(test_file);                         /* Make sure data is written to file.   */
    if (fs_fclose(test_file) != 0)
    {
      FS_TRACE_INFO((":FAIL. fs_fclose failed.\r\n"));
      break;
    }

    FS_TRACE_INFO(("\r\nReading file and comparing.\r\n"));
    if((test_file = fs_fopen("nand:0:\\TEST.LOG", "r")) == NULL)
    {
      FS_TRACE_INFO((":FAIL. fs_fopen failed.\r\n"));
      break;
    }

    num_iter = inp_num_iter;
    total_time = 0;
    max_time = 0;
    FS_TRACE_INFO((":BENCHMARK, %s,%s\r\n", "fs_fread iteration", "Time in milli seconds"));
    for (; num_iter > 0; num_iter--)
    {
      memset((void *)tstbuf, 0 , block_size);
      time_ms = MCU_HAL_GetTick();
      bytesread = fs_fread(tstbuf, sizeof(uint8_t), block_size, test_file);
      time_ms = MCU_HAL_GetTick() - time_ms;
      total_time += time_ms;
      if (time_ms > max_time)
        max_time = time_ms;

      FS_TRACE_INFO((":BENCHMARK, %d,%d\r\n", num_iter, time_ms));

      if((bytesread != block_size))
      {
        FS_TRACE_INFO((":FAIL. fs_fread failed.\r\n"));
        break;
      }
      for(i = 0; i < block_size; i++)
      {
        if(tstbuf[i] != 'A' + i%26)
        {
          FS_TRACE_INFO((":FAIL. File data mismatch.\r\n"));
          break;
        }
      }
    }
    FS_TRACE_INFO(("Average fs_fread time = %dms. Max fs_fread time= %dms. \r\n", (int)(total_time/inp_num_iter), max_time));
    FS_TRACE_INFO((":BENCHMARK, Average fs_fread time = %dms. Max fs_fread time = %dms. \r\n", (int)(total_time/inp_num_iter), max_time));
    if((num_iter == 0) && (i == block_size)) {
      FS_TRACE_INFO((":PASS. File read and compare PASS.\r\n"));
    } else {
      FS_TRACE_INFO(("Remaining count = %d\r\n",num_iter));
      break;
    }

    if (fs_fclose(test_file) != 0)
    {
      FS_TRACE_INFO((":FAIL. fs_fopen failed.\r\n"));
      break;
    }
    FS_TRACE_INFO((":PASS. R/W test PASS.\r\n"));
  } while (0);
  FS_TRACE_INFO((" tests complete.\r\n\r\n"));
}
void fs_hal_test_features(void) {
  fs_hal_mount();
  fs_hal_format(true);
  fs_hal_test_file_write_read(300, 2048);
}
#endif //TEST_FS_NAND
#endif // USE_FS
